{
    "class_name": "Functional",
    "config": {
        "name": "regnety032",
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        224,
                        224,
                        3
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_44"
                },
                "name": "input_44",
                "inbound_nodes": []
            },
            {
                "class_name": "Rescaling",
                "config": {
                    "name": "regnety032_prestem_rescaling",
                    "trainable": true,
                    "dtype": "float32",
                    "scale": 0.00392156862745098,
                    "offset": 0.0
                },
                "name": "regnety032_prestem_rescaling",
                "inbound_nodes": [
                    [
                        [
                            "input_44",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "regnety032_stem_conv",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        2,
                        2
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "HeNormal",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "regnety032_stem_conv",
                "inbound_nodes": [
                    [
                        [
                            "regnety032_prestem_rescaling",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "regnety032_stem_bn",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.9,
                    "epsilon": 1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "regnety032_stem_bn",
                "inbound_nodes": [
                    [
                        [
                            "regnety032_stem_conv",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "ReLU",
                "config": {
                    "name": "regnety032_stem_relu",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": null,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                },
                "name": "regnety032_stem_relu",
                "inbound_nodes": [
                    [
                        [
                            "regnety032_stem_bn",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "regnety032_Stage_0_YBlock_0_conv_1x1_1",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 72,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "HeNormal",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "regnety032_Stage_0_YBlock_0_conv_1x1_1",
                "inbound_nodes": [
                    [
                        [
                            "regnety032_stem_relu",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "regnety032_Stage_0_YBlock_0_conv_1x1_1_bn",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.9,
                    "epsilon": 1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "regnety032_Stage_0_YBlock_0_conv_1x1_1_bn",
                "inbound_nodes": [
                    [
                        [
                            "regnety032_Stage_0_YBlock_0_conv_1x1_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "ReLU",
                "config": {
                    "name": "regnety032_Stage_0_YBlock_0_conv_1x1_1_relu",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": null,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                },
                "name": "regnety032_Stage_0_YBlock_0_conv_1x1_1_relu",
                "inbound_nodes": [
                    [
                        [
                            "regnety032_Stage_0_YBlock_0_conv_1x1_1_bn",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "regnety032_Stage_0_YBlock_0_conv_3x3",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 72,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        2,
                        2
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 3,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "HeNormal",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "regnety032_Stage_0_YBlock_0_conv_3x3",
                "inbound_nodes": [
                    [
                        [
                            "regnety032_Stage_0_YBlock_0_conv_1x1_1_relu",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "regnety032_Stage_0_YBlock_0_conv_3x3_bn",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.9,
                    "epsilon": 1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "regnety032_Stage_0_YBlock_0_conv_3x3_bn",
                "inbound_nodes": [
                    [
                        [
                            "regnety032_Stage_0_YBlock_0_conv_3x3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "ReLU",
                "config": {
                    "name": "regnety032_Stage_0_YBlock_0_conv_3x3_relu",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": null,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                },
                "name": "regnety032_Stage_0_YBlock_0_conv_3x3_relu",
                "inbound_nodes": [
                    [
                        [
                            "regnety032_Stage_0_YBlock_0_conv_3x3_bn",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "GlobalAveragePooling2D",
                "config": {
                    "name": "regnety032_Stage_0_YBlock_0_squeeze_and_excite_gap",
                    "trainable": true,
                    "dtype": "float32",
                    "data_format": "channels_last",
                    "keepdims": true
                },
                "name": "regnety032_Stage_0_YBlock_0_squeeze_and_excite_gap",
                "inbound_nodes": [
                    [
                        [
                            "regnety032_Stage_0_YBlock_0_conv_3x3_relu",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "regnety032_Stage_0_YBlock_0_squeeze_and_excite_squeeze",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 8,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "HeNormal",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "regnety032_Stage_0_YBlock_0_squeeze_and_excite_squeeze",
                "inbound_nodes": [
                    [
                        [
                            "regnety032_Stage_0_YBlock_0_squeeze_and_excite_gap",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "regnety032_Stage_0_YBlock_0_squeeze_and_excite_excite",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 72,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "HeNormal",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "regnety032_Stage_0_YBlock_0_squeeze_and_excite_excite",
                "inbound_nodes": [
                    [
                        [
                            "regnety032_Stage_0_YBlock_0_squeeze_and_excite_squeeze",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "TFOpLambda",
                "config": {
                    "name": "tf.math.multiply_142",
                    "trainable": true,
                    "dtype": "float32",
                    "function": "math.multiply"
                },
                "name": "tf.math.multiply_142",
                "inbound_nodes": [
                    [
                        "regnety032_Stage_0_YBlock_0_squeeze_and_excite_excite",
                        0,
                        0,
                        {
                            "y": [
                                "regnety032_Stage_0_YBlock_0_conv_3x3_relu",
                                0,
                                0
                            ]
                        }
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "regnety032_Stage_0_YBlock_0_conv_1x1_2",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 72,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "HeNormal",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "regnety032_Stage_0_YBlock_0_conv_1x1_2",
                "inbound_nodes": [
                    [
                        [
                            "tf.math.multiply_142",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "regnety032_Stage_0_YBlock_0_skip_1x1",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 72,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        2,
                        2
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "HeNormal",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "regnety032_Stage_0_YBlock_0_skip_1x1",
                "inbound_nodes": [
                    [
                        [
                            "regnety032_stem_relu",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "regnety032_Stage_0_YBlock_0_conv_1x1_2_bn",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.9,
                    "epsilon": 1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "regnety032_Stage_0_YBlock_0_conv_1x1_2_bn",
                "inbound_nodes": [
                    [
                        [
                            "regnety032_Stage_0_YBlock_0_conv_1x1_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "regnety032_Stage_0_YBlock_0_skip_bn",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.9,
                    "epsilon": 1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "regnety032_Stage_0_YBlock_0_skip_bn",
                "inbound_nodes": [
                    [
                        [
                            "regnety032_Stage_0_YBlock_0_skip_1x1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "TFOpLambda",
                "config": {
                    "name": "tf.__operators__.add_379",
                    "trainable": true,
                    "dtype": "float32",
                    "function": "__operators__.add"
                },
                "name": "tf.__operators__.add_379",
                "inbound_nodes": [
                    [
                        "regnety032_Stage_0_YBlock_0_conv_1x1_2_bn",
                        0,
                        0,
                        {
                            "y": [
                                "regnety032_Stage_0_YBlock_0_skip_bn",
                                0,
                                0
                            ],
                            "name": null
                        }
                    ]
                ]
            },
            {
                "class_name": "ReLU",
                "config": {
                    "name": "regnety032_Stage_0_YBlock_0_exit_relu",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": null,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                },
                "name": "regnety032_Stage_0_YBlock_0_exit_relu",
                "inbound_nodes": [
                    [
                        [
                            "tf.__operators__.add_379",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "regnety032_Stage_0_YBlock_1_conv_1x1_1",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 72,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "HeNormal",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "regnety032_Stage_0_YBlock_1_conv_1x1_1",
                "inbound_nodes": [
                    [
                        [
                            "regnety032_Stage_0_YBlock_0_exit_relu",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "regnety032_Stage_0_YBlock_1_conv_1x1_1_bn",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.9,
                    "epsilon": 1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "regnety032_Stage_0_YBlock_1_conv_1x1_1_bn",
                "inbound_nodes": [
                    [
                        [
                            "regnety032_Stage_0_YBlock_1_conv_1x1_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "ReLU",
                "config": {
                    "name": "regnety032_Stage_0_YBlock_1_conv_1x1_1_relu",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": null,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                },
                "name": "regnety032_Stage_0_YBlock_1_conv_1x1_1_relu",
                "inbound_nodes": [
                    [
                        [
                            "regnety032_Stage_0_YBlock_1_conv_1x1_1_bn",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "regnety032_Stage_0_YBlock_1_conv_3x3",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 72,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 3,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "HeNormal",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "regnety032_Stage_0_YBlock_1_conv_3x3",
                "inbound_nodes": [
                    [
                        [
                            "regnety032_Stage_0_YBlock_1_conv_1x1_1_relu",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "regnety032_Stage_0_YBlock_1_conv_3x3_bn",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.9,
                    "epsilon": 1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "regnety032_Stage_0_YBlock_1_conv_3x3_bn",
                "inbound_nodes": [
                    [
                        [
                            "regnety032_Stage_0_YBlock_1_conv_3x3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "ReLU",
                "config": {
                    "name": "regnety032_Stage_0_YBlock_1_conv_3x3_relu",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": null,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                },
                "name": "regnety032_Stage_0_YBlock_1_conv_3x3_relu",
                "inbound_nodes": [
                    [
                        [
                            "regnety032_Stage_0_YBlock_1_conv_3x3_bn",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "GlobalAveragePooling2D",
                "config": {
                    "name": "regnety032_Stage_0_YBlock_1_squeeze_and_excite_gap",
                    "trainable": true,
                    "dtype": "float32",
                    "data_format": "channels_last",
                    "keepdims": true
                },
                "name": "regnety032_Stage_0_YBlock_1_squeeze_and_excite_gap",
                "inbound_nodes": [
                    [
                        [
                            "regnety032_Stage_0_YBlock_1_conv_3x3_relu",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "regnety032_Stage_0_YBlock_1_squeeze_and_excite_squeeze",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 18,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "HeNormal",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "regnety032_Stage_0_YBlock_1_squeeze_and_excite_squeeze",
                "inbound_nodes": [
                    [
                        [
                            "regnety032_Stage_0_YBlock_1_squeeze_and_excite_gap",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "regnety032_Stage_0_YBlock_1_squeeze_and_excite_excite",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 72,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "HeNormal",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "regnety032_Stage_0_YBlock_1_squeeze_and_excite_excite",
                "inbound_nodes": [
                    [
                        [
                            "regnety032_Stage_0_YBlock_1_squeeze_and_excite_squeeze",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "TFOpLambda",
                "config": {
                    "name": "tf.math.multiply_143",
                    "trainable": true,
                    "dtype": "float32",
                    "function": "math.multiply"
                },
                "name": "tf.math.multiply_143",
                "inbound_nodes": [
                    [
                        "regnety032_Stage_0_YBlock_1_squeeze_and_excite_excite",
                        0,
                        0,
                        {
                            "y": [
                                "regnety032_Stage_0_YBlock_1_conv_3x3_relu",
                                0,
                                0
                            ]
                        }
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "regnety032_Stage_0_YBlock_1_conv_1x1_2",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 72,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "HeNormal",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "regnety032_Stage_0_YBlock_1_conv_1x1_2",
                "inbound_nodes": [
                    [
                        [
                            "tf.math.multiply_143",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "regnety032_Stage_0_YBlock_1_conv_1x1_2_bn",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.9,
                    "epsilon": 1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "regnety032_Stage_0_YBlock_1_conv_1x1_2_bn",
                "inbound_nodes": [
                    [
                        [
                            "regnety032_Stage_0_YBlock_1_conv_1x1_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "TFOpLambda",
                "config": {
                    "name": "tf.__operators__.add_380",
                    "trainable": true,
                    "dtype": "float32",
                    "function": "__operators__.add"
                },
                "name": "tf.__operators__.add_380",
                "inbound_nodes": [
                    [
                        "regnety032_Stage_0_YBlock_1_conv_1x1_2_bn",
                        0,
                        0,
                        {
                            "y": [
                                "regnety032_Stage_0_YBlock_0_exit_relu",
                                0,
                                0
                            ],
                            "name": null
                        }
                    ]
                ]
            },
            {
                "class_name": "ReLU",
                "config": {
                    "name": "regnety032_Stage_0_YBlock_1_exit_relu",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": null,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                },
                "name": "regnety032_Stage_0_YBlock_1_exit_relu",
                "inbound_nodes": [
                    [
                        [
                            "tf.__operators__.add_380",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "regnety032_Stage_1_YBlock_0_conv_1x1_1",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 216,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "HeNormal",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "regnety032_Stage_1_YBlock_0_conv_1x1_1",
                "inbound_nodes": [
                    [
                        [
                            "regnety032_Stage_0_YBlock_1_exit_relu",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "regnety032_Stage_1_YBlock_0_conv_1x1_1_bn",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.9,
                    "epsilon": 1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
