{
    "class_name": "Functional",
    "config": {
        "name": "resnet-rs-152",
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        224,
                        224,
                        3
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_58"
                },
                "name": "input_58",
                "inbound_nodes": []
            },
            {
                "class_name": "Rescaling",
                "config": {
                    "name": "rescaling_18",
                    "trainable": true,
                    "dtype": "float32",
                    "scale": 0.00392156862745098,
                    "offset": 0.0
                },
                "name": "rescaling_18",
                "inbound_nodes": [
                    [
                        [
                            "input_58",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Normalization",
                "config": {
                    "name": "normalization_13",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "mean": [
                        0.485,
                        0.456,
                        0.406
                    ],
                    "variance": [
                        0.052441,
                        0.050176000000000005,
                        0.050625
                    ]
                },
                "name": "normalization_13",
                "inbound_nodes": [
                    [
                        [
                            "rescaling_18",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "ZeroPadding2D",
                "config": {
                    "name": "zero_padding2d_19",
                    "trainable": true,
                    "dtype": "float32",
                    "padding": [
                        [
                            1,
                            1
                        ],
                        [
                            1,
                            1
                        ]
                    ],
                    "data_format": "channels_last"
                },
                "name": "zero_padding2d_19",
                "inbound_nodes": [
                    [
                        [
                            "normalization_13",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "stem_2_stem_conv_1",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        2,
                        2
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_out",
                            "distribution": "truncated_normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "stem_2_stem_conv_1",
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_19",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "stem_2_stem_batch_norm_1",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.0,
                    "epsilon": 1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "stem_2_stem_batch_norm_1",
                "inbound_nodes": [
                    [
                        [
                            "stem_2_stem_conv_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "stem_2_stem_act_1",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                },
                "name": "stem_2_stem_act_1",
                "inbound_nodes": [
                    [
                        [
                            "stem_2_stem_batch_norm_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "stem_2_stem_conv_2",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_out",
                            "distribution": "truncated_normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "stem_2_stem_conv_2",
                "inbound_nodes": [
                    [
                        [
                            "stem_2_stem_act_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "stem_2_stem_batch_norm_2",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.0,
                    "epsilon": 1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "stem_2_stem_batch_norm_2",
                "inbound_nodes": [
                    [
                        [
                            "stem_2_stem_conv_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "stem_2_stem_act_2",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                },
                "name": "stem_2_stem_act_2",
                "inbound_nodes": [
                    [
                        [
                            "stem_2_stem_batch_norm_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "stem_2_stem_conv_3",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_out",
                            "distribution": "truncated_normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "stem_2_stem_conv_3",
                "inbound_nodes": [
                    [
                        [
                            "stem_2_stem_act_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "stem_2_stem_batch_norm_3",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.0,
                    "epsilon": 1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "stem_2_stem_batch_norm_3",
                "inbound_nodes": [
                    [
                        [
                            "stem_2_stem_conv_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "stem_2_stem_act_3",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                },
                "name": "stem_2_stem_act_3",
                "inbound_nodes": [
                    [
                        [
                            "stem_2_stem_batch_norm_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "ZeroPadding2D",
                "config": {
                    "name": "zero_padding2d_20",
                    "trainable": true,
                    "dtype": "float32",
                    "padding": [
                        [
                            1,
                            1
                        ],
                        [
                            1,
                            1
                        ]
                    ],
                    "data_format": "channels_last"
                },
                "name": "zero_padding2d_20",
                "inbound_nodes": [
                    [
                        [
                            "stem_2_stem_act_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "stem_2_stem_conv_4",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        2,
                        2
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_out",
                            "distribution": "truncated_normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "stem_2_stem_conv_4",
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_20",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "stem_2_stem_batch_norm_4",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.0,
                    "epsilon": 1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "stem_2_stem_batch_norm_4",
                "inbound_nodes": [
                    [
                        [
                            "stem_2_stem_conv_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "stem_2_stem_act_4",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                },
                "name": "stem_2_stem_act_4",
                "inbound_nodes": [
                    [
                        [
                            "stem_2_stem_batch_norm_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "BlockGroup2__block_0__conv_1",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_out",
                            "distribution": "truncated_normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "BlockGroup2__block_0__conv_1",
                "inbound_nodes": [
                    [
                        [
                            "stem_2_stem_act_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "BlockGroup2__block_0_batch_norm_1",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.0,
                    "epsilon": 1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "BlockGroup2__block_0_batch_norm_1",
                "inbound_nodes": [
                    [
                        [
                            "BlockGroup2__block_0__conv_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "BlockGroup2__block_0__act_1",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                },
                "name": "BlockGroup2__block_0__act_1",
                "inbound_nodes": [
                    [
                        [
                            "BlockGroup2__block_0_batch_norm_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "BlockGroup2__block_0__conv_2",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_out",
                            "distribution": "truncated_normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "BlockGroup2__block_0__conv_2",
                "inbound_nodes": [
                    [
                        [
                            "BlockGroup2__block_0__act_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "BlockGroup2__block_0__batch_norm_2",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.0,
                    "epsilon": 1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "BlockGroup2__block_0__batch_norm_2",
                "inbound_nodes": [
                    [
                        [
                            "BlockGroup2__block_0__conv_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "BlockGroup2__block_0__act_2",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                },
                "name": "BlockGroup2__block_0__act_2",
                "inbound_nodes": [
                    [
                        [
                            "BlockGroup2__block_0__batch_norm_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "BlockGroup2__block_0__conv_3",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_out",
                            "distribution": "truncated_normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "BlockGroup2__block_0__conv_3",
                "inbound_nodes": [
                    [
                        [
                            "BlockGroup2__block_0__act_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "BlockGroup2__block_0__batch_norm_3",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.0,
                    "epsilon": 1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "BlockGroup2__block_0__batch_norm_3",
                "inbound_nodes": [
                    [
                        [
                            "BlockGroup2__block_0__conv_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "GlobalAveragePooling2D",
                "config": {
                    "name": "BlockGroup2__block_0__se_se_squeeze",
                    "trainable": true,
                    "dtype": "float32",
                    "data_format": "channels_last",
                    "keepdims": false
                },
                "name": "BlockGroup2__block_0__se_se_squeeze",
                "inbound_nodes": [
                    [
                        [
                            "BlockGroup2__block_0__batch_norm_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Reshape",
                "config": {
                    "name": "BlockGroup2__block_0__se_se_reshape",
                    "trainable": true,
                    "dtype": "float32",
                    "target_shape": [
                        1,
                        1,
                        256
                    ]
                },
                "name": "BlockGroup2__block_0__se_se_reshape",
                "inbound_nodes": [
                    [
                        [
                            "BlockGroup2__block_0__se_se_squeeze",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "BlockGroup2__block_0__se_se_reduce",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_out",
                            "distribution": "truncated_normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "BlockGroup2__block_0__se_se_reduce",
                "inbound_nodes": [
                    [
                        [
                            "BlockGroup2__block_0__se_se_reshape",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "BlockGroup2__block_0__se_se_expand",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_out",
                            "distribution": "truncated_normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "BlockGroup2__block_0__se_se_expand",
                "inbound_nodes": [
                    [
                        [
                            "BlockGroup2__block_0__se_se_reduce",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "BlockGroup2__block_0__projection_conv",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_out",
                            "distribution": "truncated_normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "BlockGroup2__block_0__projection_conv",
                "inbound_nodes": [
                    [
                        [
                            "stem_2_stem_act_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Multiply",
                "config": {
                    "name": "BlockGroup2__block_0__se_se_excite",
                    "trainable": true,
                    "dtype": "float32"
                },
                "name": "BlockGroup2__block_0__se_se_excite",
                "inbound_nodes": [
                    [
                        [
                            "BlockGroup2__block_0__batch_norm_3",
                            0,
                            0,
                            {}
                        ],
                        [
                            "BlockGroup2__block_0__se_se_expand",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "BlockGroup2__block_0__projection_batch_norm",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.0,
                    "epsilon": 1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "BlockGroup2__block_0__projection_batch_norm",
                "inbound_nodes": [
                    [
                        [
                            "BlockGroup2__block_0__projection_conv",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add",
                "config": {
                    "name": "add_41",
                    "trainable": true,
                    "dtype": "float32"
                },
                "name": "add_41",
                "inbound_nodes": [
                    [
                        [
                            "BlockGroup2__block_0__se_se_excite",
                            0,
                            0,
                            {}
                        ],
                        [
                            "BlockGroup2__block_0__projection_batch_norm",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "BlockGroup2__block_0__output_act",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                },
                "name": "BlockGroup2__block_0__output_act",
                "inbound_nodes": [
                    [
                        [
                            "add_41",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "BlockGroup2__block_1__conv_1",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_out",
                            "distribution": "truncated_normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "BlockGroup2__block_1__conv_1",
                "inbound_nodes": [
                    [
                        [
                            "BlockGroup2__block_0__output_act",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "BlockGroup2__block_1_batch_norm_1",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.0,
                    "epsilon": 1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "BlockGroup2__block_1_batch_norm_1",
                "inbound_nodes": [
                    [
                        [
                            "BlockGroup2__block_1__conv_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "BlockGroup2__block_1__act_1",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                },
                "name": "BlockGroup2__block_1__act_1",
                "inbound_nodes": [
                    [
                        [
                            "BlockGroup2__block_1_batch_norm_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "BlockGroup2__block_1__conv_2",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_out",
                            "distribution": "truncated_normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
